In [1]:
import pandas as pd
import numpy as np

df = pd.read_csv("/Users/kemillamouri/Desktop/Data IA HETIC 2/data_refinement_project/DATA/RAW/dirty_cafe_sales.csv")
df_clean = df.copy()
df_clean.head()

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
0,TXN_1961373,Coffee,2,2.0,4.0,Credit Card,Takeaway,2023-09-08
1,TXN_4977031,Cake,4,3.0,12.0,Cash,In-store,2023-05-16
2,TXN_4271903,Cookie,4,1.0,ERROR,Credit Card,In-store,2023-07-19
3,TXN_7034554,Salad,2,5.0,10.0,UNKNOWN,UNKNOWN,2023-04-27
4,TXN_3160411,Coffee,2,2.0,4.0,Digital Wallet,In-store,2023-06-11

In [2]:
for col in df_clean.columns:
    df_clean[col] = df_clean[col].astype(str).str.strip()

In [3]:
num_cols = ["Quantity", "Price Per Unit", "Total Spent"]

for col in num_cols:
    df_clean[col] = (
        df_clean[col]
        .str.replace(",", ".", regex=False)
    )

In [4]:
for col in num_cols:
    df_clean[col] = pd.to_numeric(df_clean[col], errors="coerce")

df_clean[num_cols].head()

   Quantity  Price Per Unit  Total Spent
0       2.0             2.0          4.0
1       4.0             3.0         12.0
2       4.0             1.0          NaN
3       2.0             5.0         10.0
4       2.0             2.0          4.0

In [5]:
df_clean["Transaction Date"] = pd.to_datetime(df_clean["Transaction Date"], errors="coerce")
df_clean["Transaction Date"].head()

0   2023-09-08
1   2023-05-16
2   2023-07-19
3   2023-04-27
4   2023-06-11
Name: Transaction Date, dtype: datetime64[ns]

In [6]:
df_clean["Payment Method"] = df_clean["Payment Method"].replace({
    "credot card": "credit card",
    "creditcard": "credit card",
    "cash ": "cash",
    "cahs": "cash",
})

df_clean["Location"] = df_clean["Location"].replace({
    "dowtown": "downtown",
    "mid town": "midtown",
    "uptwon": "uptown",
})

In [7]:
df_clean = df_clean.dropna(subset=["Transaction ID", "Quantity", "Price Per Unit"])

In [8]:
df_clean = df_clean.dropna(subset=["Transaction Date"])

In [9]:
df_clean = df_clean.drop_duplicates()

In [10]:
df_clean = df_clean[(df_clean["Quantity"] > 0) & (df_clean["Quantity"] < 50)]
df_clean = df_clean[(df_clean["Price Per Unit"] > 0.5) & (df_clean["Price Per Unit"] < 50)]

In [12]:
df_clean.info()
df_clean.describe(include="all")

<class 'pandas.core.frame.DataFrame'>
Index: 8596 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    8596 non-null   object
 1   Item              8596 non-null   object
 2   Quantity          8596 non-null   float64
 3   Price Per Unit    8596 non-null   float64
 4   Total Spent       8159 non-null   float64
 5   Payment Method    8596 non-null   object
 6   Location          8596 non-null   object
 7   Transaction Date  8596 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(3), object(4)
memory usage: 604.4+ KB

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
count,8596,8596,8596.000000,8596.000000,8159.000000,8596,8596,8596
unique,8596,11,NaN,NaN,NaN,6,5,NaN
top,TXN_1961373,Juice,NaN,NaN,NaN,nan,nan,NaN
freq,1,1020,NaN,NaN,NaN,2188,2808,NaN
mean,NaN,NaN,3.020358,2.951547,8.910957,NaN,NaN,2023-07-01 20:24:04.020474880
min,NaN,NaN,1.000000,1.000000,1.000000,NaN,NaN,2023-01-01 00:00:00
25%,NaN,NaN,2.000000,2.000000,4.000000,NaN,NaN,2023-04-01 00:00:00
50%,NaN,NaN,3.000000,3.000000,8.000000,NaN,NaN,2023-07-02 00:00:00
75%,NaN,NaN,4.000000,4.000000,12.000000,NaN,NaN,2023-10-01 00:00:00
max,NaN,NaN,5.000000,5.000000,25.000000,NaN,NaN,2023-12-31 00:00:00
std,NaN,NaN,1.417477,1.276884,5.993071,NaN,NaN,NaN

In [13]:
df_clean["Payment Method"] = df_clean["Payment Method"].replace("nan", "unknown")
df_clean["Location"] = df_clean["Location"].replace("nan", "unknown")

In [14]:
df_clean["Payment Method"].value_counts()
df_clean["Location"].value_counts()

Location
unknown     2808
In-store    2602
Takeaway    2587
ERROR        312
UNKNOWN      287
Name: count, dtype: int64

In [15]:
df_clean["Location"] = df_clean["Location"].str.lower().str.strip()

df_clean["Location"] = df_clean["Location"].replace({
    "error": "unknown",
    "unknown": "unknown",
    "in-store": "in_store",
    "takeaway": "takeaway",
    "unknown": "unknown",
    "": "unknown"
})

In [16]:
df_clean["Location"].value_counts()

Location
unknown     3407
in_store    2602
takeaway    2587
Name: count, dtype: int64

In [17]:
df_clean.info()
df_clean.describe(include="all")

<class 'pandas.core.frame.DataFrame'>
Index: 8596 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    8596 non-null   object
 1   Item              8596 non-null   object
 2   Quantity          8596 non-null   float64
 3   Price Per Unit    8596 non-null   float64
 4   Total Spent       8159 non-null   float64
 5   Payment Method    8596 non-null   object
 6   Location          8596 non-null   object
 7   Transaction Date  8596 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(3), object(4)
memory usage: 604.4+ KB

,Transaction ID,Item,Quantity,Price Per Unit,Total Spent,Payment Method,Location,Transaction Date
count,8596,8596,8596.000000,8596.000000,8159.000000,8596,8596,8596
unique,8596,11,NaN,NaN,NaN,6,3,NaN
top,TXN_1961373,Juice,NaN,NaN,NaN,unknown,unknown,NaN
freq,1,1020,NaN,NaN,NaN,2188,3407,NaN
mean,NaN,NaN,3.020358,2.951547,8.910957,NaN,NaN,2023-07-01 20:24:04.020474880
min,NaN,NaN,1.000000,1.000000,1.000000,NaN,NaN,2023-01-01 00:00:00
25%,NaN,NaN,2.000000,2.000000,4.000000,NaN,NaN,2023-04-01 00:00:00
50%,NaN,NaN,3.000000,3.000000,8.000000,NaN,NaN,2023-07-02 00:00:00
75%,NaN,NaN,4.000000,4.000000,12.000000,NaN,NaN,2023-10-01 00:00:00
max,NaN,NaN,5.000000,5.000000,25.000000,NaN,NaN,2023-12-31 00:00:00
std,NaN,NaN,1.417477,1.276884,5.993071,NaN,NaN,NaN

In [18]:
df_clean.to_csv("/Users/kemillamouri/Desktop/Data IA HETIC 2/data_refinement_project/DATA/PROCESSED/cafe_sales_clean.csv", index=False)